In [2]:
import pandas as pd

# Assignment 1: Date Formats and Date Parts

* First, convert the `date` column to datetime64, by any method.

* Then, create a column representing the time difference between the last date in the data and each date. 

* Next, create columns for the date parts year, month, and weekday.

* Finally, format the date to Year-Month-Day (This will be a string/object).

In [19]:
# read in transactions.csv 
transactions = pd.read_csv("../../retail/transactions.csv")
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [25]:
transactions["date"] = pd.to_datetime(transactions["date"], errors="coerce")

In [27]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  datetime64[ns]
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 1.9 MB

In [29]:
max_date = transactions["date"].max()
max_date

Timestamp('2017-08-15 00:00:00')

In [35]:
transactions = transactions.assign(
    max_date_diff = max_date - transactions["date"]
)
transactions.head()

        date  store_nbr  transactions max_date_diff
0 2013-01-01         25           770     1687 days
1 2013-01-02          1          2111     1686 days
2 2013-01-02          2          2358     1686 days
3 2013-01-02          3          3487     1686 days
4 2013-01-02          4          1922     1686 days

In [39]:
transactions = transactions.assign(
    year=transactions.date.dt.year,
    month=transactions.date.dt.month,
    day_of_week=transactions.date.dt.dayofweek
)
transactions.head()

        date  store_nbr  transactions max_date_diff  year  month  day_of_week
0 2013-01-01         25           770     1687 days  2013      1            1
1 2013-01-02          1          2111     1686 days  2013      1            2
2 2013-01-02          2          2358     1686 days  2013      1            2
3 2013-01-02          3          3487     1686 days  2013      1            2
4 2013-01-02          4          1922     1686 days  2013      1            2

In [45]:
transactions = transactions.assign(date_str = transactions["date"].dt.strftime("%B %d, %Y"))
transactions.head()

,date,store_nbr,transactions,max_date_diff,year,month,day_of_week,date_str
0,2013-01-01,25,770,1687 days,2013,1,1,"January 01, 2013"
1,2013-01-02,1,2111,1686 days,2013,1,2,"January 02, 2013"
2,2013-01-02,2,2358,1686 days,2013,1,2,"January 02, 2013"
3,2013-01-02,3,3487,1686 days,2013,1,2,"January 02, 2013"
4,2013-01-02,4,1922,1686 days,2013,1,2,"January 02, 2013"

In [47]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           83488 non-null  datetime64[ns]
 1   store_nbr      83488 non-null  int64
 2   transactions   83488 non-null  int64
 3   max_date_diff  83488 non-null  timedelta64[ns]
 4   year           83488 non-null  int32
 5   month          83488 non-null  int32
 6   day_of_week    83488 non-null  int32
 7   date_str       83488 non-null  object
dtypes: datetime64[ns](1), int32(3), int64(2), object(1), timedelta64[ns](1)
memory usage: 4.1+ MB

# Assignment 2: Time Arithmetic


Hi again,

I just got word the the true max date in our data was three weeks after 2017-08-15.

* Can you add three weeks to the ‘time_to_last_date’ column? 
* Then, calculate ‘weeks_to_last_date’ by dividing the number of days  in ‘time_to_last_date’ by 7.

Thanks

In [49]:
# overwrite previous transactions df and convert date column

transactions = pd.read_csv("../../retail/transactions.csv", parse_dates=["date"])

In [51]:
transactions.tail()

            date  store_nbr  transactions
83483 2017-08-15         50          2804
83484 2017-08-15         51          1573
83485 2017-08-15         52          2255
83486 2017-08-15         53           932
83487 2017-08-15         54           802

In [53]:
# recreate columns from assignment 1 using assign

transactions = transactions.assign(
    year=transactions["date"].dt.year,
    month=transactions["date"].dt.month,
    day_of_week=transactions["date"].dt.dayofweek,
    time_to_last_date=transactions["date"].max() - transactions["date"],
)

transactions.head()

,date,store_nbr,transactions,year,month,day_of_week,time_to_last_date
0,2013-01-01,25,770,2013,1,1,1687 days
1,2013-01-02,1,2111,2013,1,2,1686 days
2,2013-01-02,2,2358,2013,1,2,1686 days
3,2013-01-02,3,3487,2013,1,2,1686 days
4,2013-01-02,4,1922,2013,1,2,1686 days

In [57]:
transactions["time_to_last_date"] = transactions["time_to_last_date"] + pd.to_timedelta(3, unit="W")

In [59]:
transactions.head()

,date,store_nbr,transactions,year,month,day_of_week,time_to_last_date
0,2013-01-01,25,770,2013,1,1,1708 days
1,2013-01-02,1,2111,2013,1,2,1707 days
2,2013-01-02,2,2358,2013,1,2,1707 days
3,2013-01-02,3,3487,2013,1,2,1707 days
4,2013-01-02,4,1922,2013,1,2,1707 days

In [61]:
transactions = transactions.assign(
    weeks_to_last_date = (transactions.time_to_last_date.dt.days / 7)
)

transactions.head()

,date,store_nbr,transactions,year,month,day_of_week,time_to_last_date,weeks_to_last_date
0,2013-01-01,25,770,2013,1,1,1708 days,244.000000
1,2013-01-02,1,2111,2013,1,2,1707 days,243.857143
2,2013-01-02,2,2358,2013,1,2,1707 days,243.857143
3,2013-01-02,3,3487,2013,1,2,1707 days,243.857143
4,2013-01-02,4,1922,2013,1,2,1707 days,243.857143

# Assignment 3: Missing Time Series Data

Take a look at the mean value for the oil price using forward fill, backfill, and interpolation. Are they very different?

Then, plot the series with forward fill for:
 * The year 2014.
 * The month of December 2014.
 * The days from December 1st to December 15th, 2014.

In [ ]:
# Read in oil csv with date as index (and converted to datetime64)
oil = pd.read_csv("../retail/oil.csv", 
                  index_col="date", 
                  parse_dates=True)

In [ ]:
# This is a synonym for datetime64

oil.index.dtype

In [ ]:
# mean of original series

oil.mean()

In [ ]:
# original plot

oil.plot()

# Assignment 4: Shift and Diff

Hello,
I’m looking into a few different year over year trends related to changes made at store 47.

Can you plot the sum of monthly of transactions in year 2015 vs the sum of monthly transactions in the year prior for store 47?

Make sure to group your DataFrame by year AND month!

Thanks

# Assignment 5: Resampling Time Series

Plot the monthly and yearly average oil prices.

In [ ]:
oil.head()

# Assignment 6: Rolling Averages

Plot the 90-day moving average for transactions for store 47.

This will help remove some of the noise from our series.

Thanks!

In [ ]:
# recreate transactions_47 with date as index 

transactions_47 = (transactions
                   .loc[transactions["store_nbr"]==47, ["date", "transactions"]]
                   .set_index("date"))

transactions_47.head()

In [ ]:
# original daily series for comparison

transactions_47.plot()